app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Trevahr"], ["LIMIT", 1]]
---
    def create

        if params[:new_user] == true
            @user = User.create(name: params[:name], password: params[:password])
        else
            @user = User.find_by({name: params[:name]})