app/controllers/api/v1/users_controller.rb

    def show

       @user =  User.find_by({name: params[:name]})
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Trevahr"], ["LIMIT", 1]]