app/controllers/api/v1/users_controller.rb

    def show
        token = request.headers["authentication"].split(" ")[1]
        @user = User.find(decode(token)['user_id'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]