app/controllers/bids_controller.rb

    def index
        bids = Bid.all
---
SELECT "bids".* FROM "bids"

    def show
        bid = Bid.find(params[:id])
---
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]