app/controllers/contractors_controller.rb

    def index
        contractors = Contractor.all
---
SELECT "contractors".* FROM "contractors"

    def show
        contractor = Contractor.find(params[:id])
---
SELECT  "contractors".* FROM "contractors" WHERE "contractors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]