app/controllers/reviews_controller.rb

    def show
        review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]