app/controllers/specialties_controller.rb

    def index
        specialties = Specialty.all
---
SELECT "specialties".* FROM "specialties"