app/controllers/tasks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "description", "user_id", "specialty_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["description", ""], ["user_id", 5], ["specialty_id", 1], ["created_at", "2019-09-20 21:27:32.470421"], ["updated_at", "2019-09-20 21:27:32.470421"]]
---
    def create

        user = User.find(task_params[:user_id])
        Task.create(task_params)