app/controllers/users_controller.rb

    def show

        user = User.find_by(name: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Trevahr"], ["LIMIT", 1]]