app/models/user.rb

        def self.all_users_serializer
            User.all.to_json( {
                    :only => [:id, :name],
                    :include => {:tasks =>
                        {
                            :only => [:name, :description, :specialty_id],
                                :include => {:specialty =>
                                {
                                :only => [:name, :id]
                                },
                                :bids =>
                                {
                                :only => [:name, :price, :status, :contractor_id],
                                    :include => {
                                        :contractor => {
                                            :only => [:name, :id]
                                        }
                                    }

                                }


---
SELECT "bids".* FROM "bids" WHERE "bids"."task_id" = $1  [["task_id", 5]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users"